HW5.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ru" xml:lang="ru">
<head>
<!-- 2016-11-01 Tue 14:57 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>ДЗ 5</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Михаил Волхов M3438" />
</head>
<body>
<div id="content">
<h1 class="title">ДЗ 5</h1>
<div id="table-of-contents">
<h2>&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Условия</a></li>
<li><a href="#orgheadline2">2. Решение</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Условия</h2>
<div class="outline-text-2" id="text-1">
<p>
Домашнее задание предполагает формулировку выражений реляционной
алгебры и соответствующих им SQL запросов над базой данных
"деканат".
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Решение</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><p>
Информация о студентах с заданной оценкой по предмету «Базы
данных».
</p>

\begin{align*}
π_{StudentId,StudentName,GroupName}(
σ_{CourseName='Базы Данных' ∧ P(Mark)}(
((StudentInfo ⋈ Marks) ⋈ GroupInfo) ⋈ CourseInfo))
\end{align*}

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> studentid, studentname, groupname
<span style="color: #FFA070;">from</span> (((studentinfo <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span> marks) <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span> groupinfo) <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span> courseinfo)
<span style="color: #FFA070;">where</span> coursename = <span style="color: #868B44;">'&#1041;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;'</span>
<span style="color: #FFA070;">and</span> mark &gt; 85;
</pre>
</div></li>

<li>Информацию о студентах не имеющих оценки по предмету «Базы данных»:
<ol class="org-ol">
<li><p>
Среди всех студентов.
</p>

\begin{align*}
π_{StudentId,StudentName,GroupName}(
σ_{Mark = null ∧ (CourseName = null ∨
                  CourseName = 'Базы Данных')}(
StudentInfo ⟕ Marks ⟕ CourseInfo ⋈ GroupInfo))$
\end{align*}

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> s.studentid, s.studentname, groupname
<span style="color: #FFA070;">from</span> ((studentinfo s <span style="color: #FFA070;">left</span> <span style="color: #FFA070;">join</span>
       marks <span style="color: #FFA070;">m</span> <span style="color: #FFA070;">on</span> s.studentid = <span style="color: #FFA070;">m</span>.studentid) <span style="color: #FFA070;">left</span> <span style="color: #FFA070;">join</span>
       courseinfo c <span style="color: #FFA070;">on</span> <span style="color: #FFA070;">m</span>.courseid = c.courseid) <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span>
       groupinfo
<span style="color: #FFA070;">where</span> mark <span style="color: #FFA070;">is</span> <span style="color: #FFA070;">null</span>
<span style="color: #FFA070;">and</span> (c.coursename <span style="color: #FFA070;">is</span> <span style="color: #FFA070;">null</span> <span style="color: #FFA070;">or</span> c.coursename = <span style="color: #868B44;">'&#1041;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;'</span>);
</pre>
</div></li>
<li><p>
Среди студентов, у которых есть этот предмет.
</p>

\begin{align*}
π_{StudentId,StudentName,GroupName}(σ_{Mark = null}(
(π_{CourseId}(σ_{CourseName='Базы Данных'}(CourseInfo))) ⋈ WorkingPlan ⋈ StudentInfo ⟕ Marks ⋈ GroupInfo))
\end{align*}

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> d.studentid, studentname, groupname
<span style="color: #FFA070;">from</span> ((((<span style="color: #FFA070;">select</span> courseid <span style="color: #FFA070;">from</span> courseinfo <span style="color: #FFA070;">where</span> coursename = <span style="color: #868B44;">'&#1041;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;'</span>) c
        <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span> workingplan)
       <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span> studentinfo) d
      <span style="color: #FFA070;">left</span> <span style="color: #FFA070;">join</span> marks <span style="color: #FFA070;">m</span> <span style="color: #FFA070;">using</span> (studentid))
     <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span> groupinfo
<span style="color: #FFA070;">where</span> mark <span style="color: #FFA070;">is</span> <span style="color: #FFA070;">null</span>;
</pre>
</div></li>
</ol></li>
<li><p>
Информация о студентах, имеющих хотя бы одну оценку у заданного
лектора.
</p>

\begin{align*}
π_{StudentId,StudentName,GroupName}(
(π_{LecturerId}(σ_{LecturerName='Базы Данных'}(LecturerInfo))) ⋈ WorkingPlan ⋈ (StudentInfo ⟕ Marks) ⋈ GroupInfo)
\end{align*}

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> studentid, studentname, groupname
<span style="color: #FFA070;">from</span> (<span style="color: #FFA070;">select</span> lecturerid <span style="color: #FFA070;">from</span> lecturerinfo <span style="color: #FFA070;">where</span> lecturername = <span style="color: #868B44;">'&#1043;&#1077;&#1086;&#1088;&#1075;&#1080;&#1081; &#1050;&#1086;&#1088;&#1085;&#1077;&#1077;&#1074;'</span>) k
     <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span>
     workingplan
     <span style="color: #FFA070;">inner</span> <span style="color: #FFA070;">join</span>
     (studentinfo <span style="color: #FFA070;">left</span> <span style="color: #FFA070;">join</span> marks <span style="color: #FFA070;">using</span> (studentid)) <span style="color: #FFA070;">using</span> (courseid, groupid)
     <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span>
     groupinfo;
</pre>
</div></li>
<li><p>
Идентификаторы студентов, не имеющих ни одной оценки у заданного лектора.
</p>

\begin{align*}
π_{StudentId}(σ_{Mark = null}(
σ_{LecturerName = X}(WorkingPlan ⋈ LecturerInfo) ⋈ Marks ⟖ StudentInfo))
\end{align*}

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> studentid
<span style="color: #FFA070;">from</span> (<span style="color: #FFA070;">select</span> * <span style="color: #FFA070;">from</span> (workingplan <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span> lecturerinfo) <span style="color: #FFA070;">where</span> lecturername = <span style="color: #868B44;">'&#1043;&#1077;&#1086;&#1088;&#1075;&#1080;&#1081; &#1050;&#1086;&#1088;&#1085;&#1077;&#1077;&#1074;'</span>) k
     <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span> marks
     <span style="color: #FFA070;">right</span> <span style="color: #FFA070;">join</span> studentinfo <span style="color: #FFA070;">using</span> (studentid)
<span style="color: #FFA070;">where</span> mark <span style="color: #FFA070;">is</span> <span style="color: #FFA070;">null</span>;
</pre>
</div></li>
<li><p>
Студенты, имеющих оценки по всем предметам заданного лектора.
</p>

\begin{align*}
BoolAnd_{HasMark, \{StudentId\}}(
π_{\{StudentId,HasMark=(Mark == null)\}}(
π_{\{GroupId,CourseId\}}(WorkingPlan ⋈ LecturerInfo) ⋈ StudentInfo ⟕ StudentInfo))
\end{align*}

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> studentid,bool_and(hasMark) <span style="color: #FFA070;">as</span> allHasMark
<span style="color: #FFA070;">from</span> (<span style="color: #FFA070;">select</span> studentid, (<span style="color: #FFA070;">case</span> <span style="color: #FFA070;">when</span> (mark <span style="color: #FFA070;">is</span> <span style="color: #FFA070;">null</span>) <span style="color: #FFA070;">then</span> <span style="color: #FFA070;">false</span> <span style="color: #FFA070;">else</span> <span style="color: #FFA070;">true</span> <span style="color: #FFA070;">end</span>) <span style="color: #FFA070;">as</span> hasMark
      <span style="color: #FFA070;">from</span> ((<span style="color: #FFA070;">select</span> groupid,courseid
              <span style="color: #FFA070;">from</span> (workingplan <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span> lecturerinfo)
              <span style="color: #FFA070;">where</span> lecturername = <span style="color: #868B44;">'&#1043;&#1077;&#1086;&#1088;&#1075;&#1080;&#1081; &#1050;&#1086;&#1088;&#1085;&#1077;&#1077;&#1074;'</span>) k
            <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span> studentinfo
            <span style="color: #FFA070;">left</span> <span style="color: #FFA070;">join</span> marks <span style="color: #FFA070;">using</span> (courseid, studentid))) z
<span style="color: #FFA070;">group</span> <span style="color: #FFA070;">by</span> studentid;
</pre>
</div></li>
<li><p>
Для каждого студента имя и предметы, которые он должен посещать.
</p>

\begin{align*}
π_{StudentName,CourseName}(StudentInfo ⋈ GroupInfo ⋈ WorkingPlan ⋈ CourseInfo)
\end{align*}

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> <span style="color: #FFA070;">distinct</span> studentname, coursename
<span style="color: #FFA070;">from</span> studentinfo <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span> groupinfo <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span> workingplan <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span> courseinfo
<span style="color: #FFA070;">order</span> <span style="color: #FFA070;">by</span> studentname;
</pre>
</div>

<p>
<a href="http://stackoverflow.com/a/43944">http://stackoverflow.com/a/43944</a>
В Postgre 9 можно аггрегировать по строчкам через запятую
(<code>string_agg/array_agg</code>), если это то, что требовалось. В
дальшейшем я буду предполагать, что нет, потому что функция
достаточно специфичная.
</p></li>
<li><p>
По лектору все студенты, у которых он хоть что-нибудь преподавал.
</p>

\begin{align*}
π_{LecturerName,StudentName}(LecturerInfo ⋈ WorkingPlan ⋈ GroupInfo ⋈ CourseInfo)
\end{align*}

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> <span style="color: #FFA070;">distinct</span> lecturername, studentname
<span style="color: #FFA070;">from</span> (lecturerinfo <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span> workingplan <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span> groupinfo <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span> studentinfo);
</pre>
</div></li>
<li>TODO</li>
<li>TODO</li>
<li>Средний балл студента. Будем считать, что средний балл &#x2013;
средний по всем предметам, который студент изучеает. Оценки нет
=&gt; оценка 0. Примечание: интерфейс функции в терминах алгебры
подразумевает выкидывание всех атрибутов кроме тех, по которым
итерируемся. Будем считать, что они не выкидываются, иначе
запрос придется копировать дважды.
<ol class="org-ol">
<li><p>
По идентификатору.
</p>

\begin{align*}
Avg_{Average, \{markReal\}}(ε_{markReal = if null mark then 0
else mark}(π_{StudentId,StudentName}(
σ_{studentid=X}(StudentInfo ⋈ GroupInfo ⋈ WorkingPlan ⟕ Marks))))
\end{align*}

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> <span style="color: #8fbfdc;">avg</span>(markReal) <span style="color: #FFA070;">as</span> average
<span style="color: #FFA070;">from</span> (<span style="color: #FFA070;">select</span> studentid,
             studentname,
             (<span style="color: #FFA070;">case</span> <span style="color: #FFA070;">when</span> (mark <span style="color: #FFA070;">is</span> <span style="color: #FFA070;">null</span>) <span style="color: #FFA070;">then</span> 0 <span style="color: #FFA070;">else</span> mark <span style="color: #FFA070;">end</span>) <span style="color: #FFA070;">as</span> markReal
      <span style="color: #FFA070;">from</span> (studentinfo <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span>
            groupinfo <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span>
            workingplan <span style="color: #FFA070;">left</span> <span style="color: #FFA070;">join</span>
            marks <span style="color: #FFA070;">using</span> (studentid,courseid))
      <span style="color: #FFA070;">where</span> studentid = 1) z
<span style="color: #FFA070;">group</span> <span style="color: #FFA070;">by</span> studentid, studentname;
</pre>
</div></li>
<li><p>
Для каждого студента.
</p>
\begin{align*}
Avg_{Average, \{markReal\}}(ε_{markReal = if null mark then 0
else mark}(π_{StudentId,StudentName}(StudentInfo ⋈ GroupInfo ⋈ WorkingPlan ⟕ Marks)))
\end{align*}

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> studentid, studentname, <span style="color: #8fbfdc;">avg</span>(markReal) <span style="color: #FFA070;">as</span> average
<span style="color: #FFA070;">from</span> (<span style="color: #FFA070;">select</span> studentid,
             studentname,
             (<span style="color: #FFA070;">case</span> <span style="color: #FFA070;">when</span> (mark <span style="color: #FFA070;">is</span> <span style="color: #FFA070;">null</span>) <span style="color: #FFA070;">then</span> 0 <span style="color: #FFA070;">else</span> mark <span style="color: #FFA070;">end</span>) <span style="color: #FFA070;">as</span> markReal
      <span style="color: #FFA070;">from</span> (studentinfo <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span>
            groupinfo <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span>
            workingplan <span style="color: #FFA070;">left</span> <span style="color: #FFA070;">join</span>
            marks <span style="color: #FFA070;">using</span> (studentid,courseid))) z
<span style="color: #FFA070;">group</span> <span style="color: #FFA070;">by</span> studentid, studentname;
</pre>
</div></li>
</ol></li>
<li><p>
Средний балл средних баллов студентов каждой группы.
</p>

\begin{align*}
Avg_{AverageGroup, \{AverageStudent\}}(
π_{GroupId,AverageStudent}(
Avg_{AverageStudent, \{markReal\}}(
ε_{markReal = if null mark then 0 else mark}(
π_{StudentId,GroupId}(
StudentInfo ⋈ GroupInfo ⋈ WorkingPlan ⟕ Marks)))))
\end{align*}

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> groupid, <span style="color: #8fbfdc;">avg</span>(averageStudent) <span style="color: #FFA070;">as</span> averageGroup
<span style="color: #FFA070;">from</span> (<span style="color: #FFA070;">select</span> groupid, <span style="color: #8fbfdc;">avg</span>(markReal) <span style="color: #FFA070;">as</span> averageStudent
      <span style="color: #FFA070;">from</span> (<span style="color: #FFA070;">select</span> studentid,
                   groupid,
                   (<span style="color: #FFA070;">case</span> <span style="color: #FFA070;">when</span> (mark <span style="color: #FFA070;">is</span> <span style="color: #FFA070;">null</span>) <span style="color: #FFA070;">then</span> 0 <span style="color: #FFA070;">else</span> mark <span style="color: #FFA070;">end</span>) <span style="color: #FFA070;">as</span> markReal
            <span style="color: #FFA070;">from</span> (studentinfo <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span>
                  groupinfo <span style="color: #FFA070;">natural</span> <span style="color: #FFA070;">join</span>
                  workingplan <span style="color: #FFA070;">left</span> <span style="color: #FFA070;">join</span>
                  marks <span style="color: #FFA070;">using</span> (studentid,courseid))) z
      <span style="color: #FFA070;">group</span> <span style="color: #FFA070;">by</span> studentid, groupid) y
<span style="color: #FFA070;">group</span> <span style="color: #FFA070;">by</span> groupid;
</pre>
</div></li>
<li>TODO</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#1040;&#1074;&#1090;&#1086;&#1088;: Михаил Волхов M3438</p>
<p class="date">Created: 2016-11-01 Tue 14:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
